{
   "31256788-71fb-4003-a9ca-9e6164a8faa3" : {
      "title" : "SMAR Driver (Gen 8)",
      "description" : "The brain of the race car. Connects to the SMAR Engine and steering bearings. Handles perception, decision making, and actions. Must be placed on a lift to initialize car dimensions correctly."
   },
   "74bfdcd7-cfb2-4791-9611-602154eb90dd" : {
      "title" : "SMAR Engine (Gen 8)",
      "description" : "The heart of the car. Connects to the Driver and wheel bearings. Simulates RPM, torque, and gears. Features custom audio and tuning support."
   },
   "4af0f758-21b4-446b-9196-afeefbbe5adb" : {
      "title" : "SMAR Track Scanner",
      "description" : "Generates racing lines. Place at the start/finish line facing the track direction. Interact to scan or toggle visibility. Use the hammer to edit nodes manually."
   },
   "7cb34732-7938-4e50-9db3-bdb57e3ab2b7" : {
      "title" : "SMAR Track Loader",
      "description" : "Saves and loads track data. Place near the start line to save the generated track to the world or blueprint. Essential for persisting track layouts."
   },
   "1e3b7ff3-d066-4b8b-9cb1-fa4a6ad8cc7c" : {
      "title" : "SMAR Downforce Unit",
      "description" : "Applies aerodynamic downforce to the vehicle. Adjust force by interacting ('E' to increase, Crouch+'E' to decrease). Improves cornering grip."
   },
   "5703a73b-206c-420f-b75d-03ad028ebe6d" : {
      "title" : "SMAR Race Control",
      "description" : "Manages the race state (Practice, Qualifying, Race). Connect logic inputs to start/stop. Interacting opens the race settings menu."
   },
   "54cea7fe-d26f-4660-b882-0a25cf4db710" : {
      "title" : "SMAR Checkpoint",
      "description" : "Defines track segments and splits. Place sequentially around the track after scanning. Auto-connects splines. Shoot to clear nodes."
   },
   "895664c9-dec0-43eb-9c57-6315c907c6cf" : {
      "title" : "SMAR Camera",
      "description" : "Static trackside camera. Used for broadcasting angles. Requires external scripts for full functionality."
   },
   "90137355-8dda-404c-b19b-80a10b75729c" : {
      "title" : "Brake Light Controller",
      "description" : "Visual feedback for braking. Connect the Driver to this, and this to the brake lights. Lights up when the AI applies brakes."
   },
   "9c327ca3-5dbe-46ad-9910-7b362964377d" : {
      "title" : "SMAR Pit Point",
      "description" : "Defines the pit lane path. Use specific colors to designate the path type (entry, lane, exit)."
   },
   "b27a43d6-a8f1-4973-b5df-c39e5c4cdeb8" : {
      "title" : "SMAR Pit Box",
      "description" : "Designates the stopping area for pit stops. Place in the pit lane where cars should service. Resizable."
   },
   "14d0a0b5-3b31-4e3a-8f21-f3a0513b0f4c" : {
      "title" : "SMAR Race Control Tool",
      "description" : "Mobile Race Control Tool"
   }
}